[
  {
    "id": 1,
    "year": 1998,
    "name": "Hip-Hop Stage 4</br>Windsor, CA",
    "description": "Back in '98 RoxRite was a freshman b-boy trying to earn his stripes: entering competitions, trying to do the kind of moves he saw others doing, and doing what he thought would win him favor. After a couple of humbling losses, he entered his third-ever competition, deciding to simply \"do what I’m good at.\" This straightforward truth is the backbone of his deceptively simple, clean, always flawless style. (July 1998)",
    "artist": "",
    "artisturl": "",
    "gridsrc": "images/artwork-opt/001-t.jpg",
    "src": "images/artwork-opt/001.jpg",
    "type": "image",
    "original": "https://www.facebook.com/redbull/videos/2014214405487744/"
  },
  {
    "id": 2,
    "year": 1998,
    "name": "Escape</br>Santa Rosa, CA",
    "description": "Fresh off his first crew win, RoxRite brought out new moves, new confidence and heightened focus for his first solo tournament victory. \"It's like you're ... building yourself up for this moment\", RoxRite says. And then when I go into the contest and that one on one. I was like, 'Yo, I got this, like I already know how to do this, send me.' So then I walk into it and I finally just did it in a competition format.\" He got his first solo win, with a grand prize of $50 in ones—all of which spent on his crew at Jack In The Box. (July 1998)",
    "artist": "Ryan Humphrey",
    "artisturl": "",
    "gridsrc": "images/artwork-opt/002-t.jpg",
    "type": "video",
    "video": "WF34N4gJAKE",
    "original": "https://www.facebook.com/roxrite95/videos/1542481575865326/"
  },
  {
    "id": 3,
    "year": 1998,
    "name": "Wild Style</br>Sacramento, CA",
    "description": "At Sacramento’s Wild Style Battle, RoxRite won the three on three alongside his mentor, SUB-4 founder Ground Level—the one who gave RoxRite his b-boy name. “Just getting the chance to battle with him was big,” RoxRite says. “We battled before, but to win one together was rewarding, because all the years that we put in together paid off. It's rewarding to go to a battle, that’s not local and where there's higher-level competition, and win with somebody that you pretty much grew up with.” Their third man was Mikey Ice, from Madera, CA, who had played a crucial part in their development. “He used to send (Ground Level) video tapes from a lot of the world events at that time. (Mikey) had influenced us by sending those tapes for us to see what's going on in the world. We grew up in a small town where people don't really break unless you go to San Francisco or you go into the big cities.” Before the internet, the only way b-boys knew about talent in other places besides word of mouth was through the piecemeal trading of homemade VHS tapes. “It was only whatever you got,” says RoxRite. “Everything wasn't at your disposal; maybe you might get a Battle of the Year or you might get the one tape that was only regional.” VHS tapes recorded at jams from around the world traded hands, spread knowledge, and—as RoxRite would soon learn himself—made reputations. (October 1998)",
    "artist": "Julio Cesar Battistelli",
    "artisturl": "",
    "gridsrc": "images/artwork-opt/003-t.jpg",
    "src": "images/artwork-opt/003.jpg",
    "type": "image",
    "original": ""
  },
  {
    "id": 7,
    "year": 1999,
    "name": "Battle of the Illest</br>Windsor, CA",
    "description": "With just a year of competitive b-boying under his belt, lighting up the NorCal battle scene, RoxRite began to graduate to regional jams. In spring of ‘99, he competed in the Battle of the Illest, in a 2 on 2 in Windsor, CA, about an hour north of San Francisco. “It was a turning point,” says RoxRite. “Coming to that event really opened my eyes and I got to see so many different styles from around the United States and around the world. It really opened my eyes to seeing the possibilities of how much more you can grow, you know? Besides being local.” Years of constant practice were bringing him to a new level of ease and fluidity in his repertoire; RoxRite considered it his coming out party, one of the best performances to date of his young career. (March 1999)",
    "artist": "",
    "artisturl": "",
    "gridsrc": "images/artwork-opt/007-t.jpg",
    "src": "images/artwork-opt/007.jpg",
    "type": "video",
    "video": "WF34N4gJAKE",
    "original": "https://www.instagram.com/p/BfD_GGyFRuS/?taken-by=roxrite95"
  },
  {
    "id": 9,
    "year": 2000,
    "name": "TKLocal Spotlight</br>Santa Rosa, CA",
    "description": "One of the smallest competitions RoxRite ever entered presented an unusual obstacle, for once having nothing to do with fierce opponents, injury, or lack of practice. It was simply a bouncer checking ID’s; Roxrite and his Sonoma Country crew Straight Up B-boys 4 Life (SUB-4) were all underrage. \"We snuck in,\" he admits. After refusing to let state laws stop their flow, they took the competition out. (January 2000)",
    "artist": "Chris McDonnell",
    "artisturl": "",
    "gridsrc": "images/artwork-opt/009-t.jpg",
    "src": "images/artwork-opt/009.jpg",
    "type": "video",
    "video": "WF34N4gJAKE",
    "original": "https://www.instagram.com/p/BfLqMMylD7Q/?taken-by=roxrite95"
  },
  {
    "id": 11,
    "year": 2000,
    "name": "Showdown</br>San Francisco, CA",
    "description": "The Renegade Rockers were on a mission to reestablish themselves as a crew. This event was RoxRite’s second outing with the veteran squad and he was already making a name for himself. “It was just a good fit from the beginning,” says his teammate Dee Rock, “we all meshed pretty well ... He had his own style, he was doing a lot of footwork when people weren't really doing footwork. He had just, basically a lot of ... he was killing it!\" (July 2000)",
    "artist": "",
    "artisturl": "",
    "gridsrc": "images/artwork-opt/011-t.jpg",
    "src": "images/artwork-opt/011.jpg",
    "type": "video",
    "video": "WF34N4gJAKE",
    "original": "https://www.instagram.com/p/Be_dw9LBcUI/?taken-by=redbull"
  },
  {
    "id": 14,
    "year": 2000,
    "name": "Bboy Battle</br>Petaluma, CA",
    "description": "This event in Petaluma, CA wasn’t particularly memorable for RoxRite, but it served more of a purpose than mere practice. “Some of those little local ones,” he said, “they didn’t really have much talent, they’re just kind of like, ‘Enter; you might battle one or two guys and then you win. That’s it.’ I was 16 or 17—so you just try to put your name up.” Crushing small competitions was always a good way to bolster the rep of a fledgling dancer. You never knew who might be judging: an influential b-boy from a legendary crew who could spread the word about you (or want to recruit you) or just a new friend or mentor. And of course, you might not be able to pass up an opportunity to show your skills. (November 2000)",
    "artist": "Stephen Halker",
    "artistrul": "",
    "gridsrc": "images/artwork-opt/014-t.gif",
    "src": "images/artwork-opt/014.gif",
    "type": "image",
    "original": ""
  },
  {
    "id": 16,
    "year": 2001,
    "name": "Hip-Hop Nationa Dance Battle</br>San Francisco, CA",
    "description": "Not yet in his twenties, RoxRite was still b-boying for fun, but was juggling work and a girlfriend (his first serious relationship) to boot. \"You have a serious relationship, you have a job, and then you start having things that you've never had before, like, bills to pay.\" Just healed up from a shoulder injury, RoxRite and crew went head-on against a squad from Sacramento. \"It was a close battle, and it came down to a tiebreaker. They gave me the tiebreaker round, which I was like, \"oh shit, I don't even know if I feel 100% right now.\" I went on and did as much shit as I could in one round.\" The average round in a contest is 30 seconds—RoxRite poured it on for a minute and a half. \"It was really long. I tried this and I tried that. I threw this and I threw that. That's probably one of the longest rounds I ever did in a contest.\" (August 2001)",
    "artist": "Stephen Halker",
    "artisturl": "",
    "gridsrc": "images/artwork-opt/016-t.gif",
    "src": "images/artwork-opt/016.gif",
    "type": "image",
    "original": ""
  },
  {
    "id": 23,
    "year": 2003,
    "name": "Bboy Masters Pro-AM</br>San Francisco, CA",
    "description": "Back in 1999, RoxRite had only been on the circuit for a year. Though he didn’t win then, his appearance at the B-boy Masters Pro-Am that year made his name ring far beyond his Sonoma County stomping grounds, via the VHS recording that was traded by hand afterwards. (You can find it on Youtube today, and you can find him—credited as “RocsRite”—in the yellow t-shirt.) A few years later, for his 21st birthday, instead of having a rager, he gave it his all at the 2003 Pro-Am in San Francisco, and took the solo title. (April 2003) ",
    "artist": "Alis Atwell, Sergiy Barchuk",
    "artisturl": "",
    "gridsrc": "images/artwork-opt/023-t.jpg",
    "src": "images/artwork-opt/023.jpg",
    "type": "image",
    "original": "https://www.instagram.com/p/BfbHKecFneO/?taken-by=roxrite95"
  },
  {
    "id": 25,
    "year": 2003,
    "name": "Mighty 4 Footwork</br>(Raiders Of the Lost Art)</br>San Jose, CA",
    "description": "\"Footwork,\" says RoxRite, \"is the fundamental of the dance. Footwork is when you're on the floor with your hands and your feet and you're moving through the motions around your body and your hands. Your feet are scrambling around you a lot, you start playing with different concepts and techs, you start playing with patterns with your legs, crossing your legs, changing directions.\" (July 2003)",
    "artist": "Ben Marra",
    "artisturl": "",
    "gridsrc": "images/artwork-opt/025-t.jpg",
    "src": "images/artwork-opt/025.jpg",
    "type": "video",
    "original": ""
  },
  {
    "id": 27,
    "year": 2003,
    "name": "Beat Box</br>Modesto, CA",
    "description": "Before social media, b-boys relied on word of mouth to know about jams. RoxRite got a call from Dee Rock that day — ”it was just like, 'Yo, there's a battle in Modesto,' and it's like 3 p.m. and we're in Frisco ... like, \"Oh fuck it. Let’s go then!\" We drive all the way to Modesto, we beat everybody and go back home.” (October 2003)",
    "artist": "Alis Atwell, Sergiy Barchuk",
    "artisturl": "",
    "gridsrc": "images/artwork-opt/027-t.jpg",
    "src": "images/artwork-opt/027.jpg",
    "type": "image",
    "original": "https://www.instagram.com/p/BfGsHFUFfjYCIrGDpFkOy_r6W1Hoellj8fTt3g0/"
  },
  {
    "id": 29,
    "year": 2004,
    "name": "A New Hope</br>San Jose, CA",
    "description": "\"We put on one of the best tournament performances we ever had as a crew,\" says RoxRite. \"This is another night in which I had never felt so natural with the way I connected my moves.\" (March 2004)",
    "artist": "Dan Lish ",
    "artisturl": "",
    "gridsrc": "images/artwork-opt/029-t.jpg",
    "src": "images/artwork-opt/029.jpg",
    "type": "image",
    "original": ""
  },
  {
    "id": 31,
    "year": 2004,
    "name": "Battle Ave</br>Fairfield, CA",
    "description": "RoxRite entered this small local competition, the final after a series of qualifiers; he went up against some of the area’s top b-boys and took the solo title. At this point the Renegades were staying firmly local, rebuilding their rep at home. “I was staying with my crew,” RoxRite said, “and the opportunities were there. I was winning everything here by myself or with my crew. They were still very secluded; Renegades practiced here.” Meanwhile, he watched other world-class b-boys travel everywhere, forming ad hoc crews to win titles overseas. (July 2004)",
    "artist": "",
    "artisturl": "",
    "gridsrc": "images/artwork-opt/031-t.jpg",
    "src": "images/artwork-opt/031.jpg",
    "type": "image",
    "original": ""
  },
  {
    "id": 35,
    "year": 2005,
    "name": "Ashes 2 Ashes</br>Portland, OR",
    "description": "In this intense solo faceoff against some of the best international b-boys competition, after 50 minutes (including a half-dozen straight rounds) RoxRite and future champion Omar were the last men standing, in a first-place tie, 8 points apiece. (February 2005) ",
    "artist": "Stephen Halker",
    "artisturl": "",
    "gridsrc": "images/artwork-opt/035-t.gif",
    "src": "images/artwork-opt/035.gif",
    "type": "gif",
    "original": "https://www.instagram.com/p/BfqhOXYlE56/?taken-by=roxrite95"
  },
  {
    "id": 47,
    "year": 2007,
    "name": "Style Wars</br>Santa Fe, NM",
    "description": "In September 2006, RoxRite sustained the worst injury of his career. “I got hurt in a battle in Japan (B1 Championship) that I won with Lego,” RoxRite explains. “After that I lost the next weekend at the UK Champs. Idiot. Dumb thing to do. People will never know the backstory to it; they just see what they see, and if you don’t perform to your standards, then it’s like, ‘Oh you fell off.’” A lot of people will be like, ‘Why the fuck did you enter’? I don’t like using that as an excuse.” Comments about his performance after his injury still bothered RoxRite; but whether it was by virtue of pride, upbringing, or RoxRite’s highly competitive and private nature, it was hard for him to discuss his injury publicly. “I have to keep my private life private even if they publish it. I don’t like to publicize stuff like that. It’s not in me. I’m like, ‘I’m doing this by myself. I’m gonna get through this.’” After a couple months’ worth of healing, RoxRite and Kid David took top honors in a tournament against Southwest crews. “That was the first time I went into a battle not feeling any pain in my arm,” RoxRite said. “By January of 2007 I was finally feeling okay to break on the arm. That was my first real competition after the injury.” (January 2007)",
    "artist": "Stephen Halker",
    "artisturl": "",
    "gridsrc": "images/artwork-opt/047-t.jpg",
    "src": "images/artwork-opt/047.jpg",
    "type": "video",
    "original": "https://www.instagram.com/p/BfV1cdxFibj/?taken-by=roxrite95"
  },
  {
    "id": 49,
    "year": 2007,
    "name": "Chelles Battle Pro</br>Chelles, France",
    "description": "RoxRite and Kid David's Outbreak 3 victory earned them a slot on a team with some of the US’s best b-boys, all together under the banner of BBoyWorld (the culture’s popular online destination). This new crop of all-stars made their debut together at this high-profile battle in the eastern Paris suburb of Chelles. (March 2007)",
    "artist": "",
    "artisturl": "",
    "gridsrc": "images/artwork-opt/049-t.jpg",
    "src": "images/artwork-opt/049.jpg",
    "type": "video",
    "original": "https://www.facebook.com/redbullBCOne/videos/10156116056168119/"
  },
  {
    "id": 50,
    "year": 2007,
    "name": "2 Man Platoon Championships</br>San Francisco, CA",
    "description": "RoxRite and Kid David’s chemistry was really starting to gel by the time of this San Francisco competition “This became our coming out battle with Kid David,” said RoxRite of the event. “After struggling in battles and coming up short in final rounds of tournaments, we finally broke through and established what was to come.\" But there was tension in the air that day: RoxRite and David were going against Sacramento DSD1, who RoxRite had had personal issues with since 2002. “In the finals they went against DSD1,” says Flexum, who’d battled RoxRite and Kid David earlier that day. “Oh my goodness, it looked like hands were going to get tossed around.” A hotly contested decision didn’t go in DSD1’s favor. “It got really, really heated and really scary. When that tension got really high at the finals and things started going down, they almost got a rise out of (RoxRite). But it was only because it wasn't about dancing; it looked like hands was about to be thrown. And at that time, Kid David was just a kid. We all kind of rose. Like, ‘you guys need to step back.’” “We beat them,” said RoxRite, “and they got so mad that they posted a video making fun of David, wearing the same clothes as him, saying ‘this is what we lost to’ [It turned into] this big ass heated online argument.” “I remember one of the guys we were battling making a clip making fun of me,” Kid David laughs, “taking a bunch of my moves. It's so random I remember that now; me being all butthurt because these fools made a video making fun of me.” (April 2007)",
    "artist": "",
    "artisturl": "",
    "gridsrc": "images/artwork-opt/050-t.jpg",
    "src": "images/artwork-opt/050.jpg",
    "type": "image",
    "original": "https://www.instagram.com/p/Bfi1joiFjTw/"
  },
  {
    "id": 52,
    "year": 2007,
    "name": "B1 Championships</br>Osaka, Japan",
    "description": "After sustaining his career-worst injury at the previous year’s B1 Championship in Osaka, RoxRite returns to Japan, his arm back strong, and more than determined to give the performance he was meant to give the first time. They battled some hard competition and took the 2 on 2 title, making this RoxRite’s 3rd win in a row that year. (October 2007) ",
    "artist": "Chris McDonnell",
    "artisturl": "",
    "gridsrc": "images/artwork-opt/052-t.jpg",
    "src": "images/artwork-opt/052.jpg",
    "type": "video",
    "original": "https://www.instagram.com/p/Bfdkn5dl7NK/?hl=en&taken-by=roxrite95"
  },
  {
    "id": 56,
    "year": 2008,
    "name": "Battle Timez</br>Bayside, CA",
    "description": "Fresh off a month long tour in Australia, RoxRite was having a rare off night. \"I started noticing the toll I was taking from a lot of traveling and also keeping up with my diet,\" says RoxRite. \"I wasn’t practicing as much for a while because when I was doing all this battling. I was riding off stuff I was doing years before and I was bringing out moves I wasn’t using as much. I was riding on old concepts at that time. At that point, I wasn’t as innovative in my own style anymore. Instead of newer things, I was executing something I had for years. I was really off for that event. I felt heavy.\" Luckily, his all-star crew, the B-Boy World team, took up the slack. It was RoxRite's last event with B-Boy World, sowing the beginnings of the Squadron. (September 2008)",
    "artist": "",
    "artisturl": "",
    "gridsrc": "images/artwork-opt/056-t.jpg",
    "src": "images/artwork-opt/056.jpg",
    "type": "video",
    "original": "https://twitter.com/RoxRite/status/967788340274753536"
  },
  {
    "id": 59,
    "year": 2008,
    "name": "Hip-Hop National Dance Battle</br>San Francisco, CA",
    "description": "Fresh off a month long tour in Australia, RoxRite was having a rare off night. \"I started noticing the toll I was taking from a lot of traveling and also keeping up with my diet,\" says RoxRite. \"I wasn’t practicing as much for a while because when I was doing all this battling. I was riding off stuff I was doing years before and I was bringing out moves I wasn’t using as much. I was riding on old concepts at that time. At that point, I wasn’t as innovative in my own style anymore. Instead of newer things, I was executing something I had for years. I was really off for that event. I felt heavy.\" Luckily, his all-star crew, the B-Boy World team, took up the slack. It was RoxRite's last event with B-Boy World, sowing the beginnings of the Squadron. (September 2008)",
    "artist": "",
    "artisturl": "",
    "gridsrc": "images/artwork-opt/059-t.jpg",
    "src": "images/artwork-opt/059.jpg",
    "type": "video",
    "original": "https://twitter.com/RoxRite/status/967788340274753536"
  },
  {
    "id": 64,
    "year": 2009,
    "name": "R16</br>Seoul, South Korea",
    "description": "Renegades were invited to compete in the biggest world championship in Asia and needed someone to rep in the solo category. RoxRite was the best choice, though it had been a year since he’d competed solo. His first round was too close for comfort but after that, RoxRite found his rhythm, running through opponents on the way to his second major World solo title. (September 2009)",
    "artist": "Alis Atwell, Sergiy Barchuk",
    "artisturl": "",
    "gridsrc": "images/artwork-opt/064-t.jpg",
    "src": "images/artwork-opt/064.jpg",
    "type": "image",
    "original": "https://www.instagram.com/p/BfTIArVls5N/?taken-by=redbullkr"
  },
  {
    "id": 69,
    "year": 2010,
    "name": "Cypher City Footwork Battle</br>San Diego, CA",
    "description": "\"There's a lot of different elements in footwork,\" says RoxRite, \"but that is what we consider part of our foundation. Everything is based around your footwork. If you're gonna be a very well developed b-boy, your footwork should be very strong.\" (March 2010)",
    "artist": "",
    "artisturl": "",
    "gridsrc": "images/artwork-opt/069-t.jpg",
    "src": "images/artwork-opt/069.jpg",
    "type": "video",
    "original": "https://www.instagram.com/p/Bfg6ncOB6G4/?taken-by=redbull"
  },
  {
    "id": 78,
    "year": 2012,
    "name": "The Bug Out</br>San Diego, CA",
    "description": "Another day, another competition. This time, a local San Diego event with no brackets, just cyphers—b-boys in a circle, taking turns showing and proving. Whoever rocked the most quality rounds would be crowned the evening’s cypher king. ”These type of events are hard to rock,” says RoxRite. “I ended up doing over 30 rounds that night.” (February 2012)",
    "artist": "Stephen Halker",
    "artisturl": "",
    "gridsrc": "images/artwork-opt/078-t.gif",
    "src": "images/artwork-opt/078.gif",
    "type": "gif",
    "original": "https://www.facebook.com/roxrite95/videos/1547218832058267/?hc_ref=ARQ0HIO_PnQ4SYeWvaQ34RInOJ0H-RhYcaxnIvLvgi1Cw8xRgr5TRb5pYO3YASgRWc0&fref=nf"
  },
  {
    "id": 81,
    "year": 2013,
    "name": "Circle Industry 3</br>Salzburg, AT",
    "description": "Another big win in Europe for the Renegades, courtesy of their most prolific duo. \"Basically, since 2012 I'd kind of stepped back from the battle competition, breakdancing scene,\" says Kid David. \"I got more into acting and I wasn't dancing that much. That was like my first 'let's see if you've still got it!' battle. I took a little break from competing and came back with RoxRite. Even if it's not day-to-day, we would have these days and we'd be on. It was one of those nights.\" \"Pitted in the hardest bracket,\" says RoxRite, \"we highlighted our chemistry and really showed how far we've come.\" Kid David agrees: \"We beat one of the bigger Korean crews there (Jinjo). It was like one of those things where all the countries were representing. But then we showed up.\" (May 2013)",
    "artist": "Bryan Woodland",
    "artisturl": "",
    "gridsrc": "images/artwork-opt/081-t.jpg",
    "src": "images/artwork-opt/081.jpg",
    "type": "image",
    "original": ""
  }
]
